[
  {
    "slug": "enterprise-ux-systems",
    "title": "Enterprise UX Systems",
    "year": "2025–ongoing",
    "description": "Enterprise UX Systems brings together a set of internal digital platforms designed for enterprise contexts, focused on operational workflows, request handling, and content-heavy environments. The projects were developed under confidentiality constraints and within existing technical and organizational frameworks.\n\nAs part of Propp, my contribution focuses on UX and UI design, including information architecture, user flows, state-based diagrams, and the development of shared design systems. The work involves extending and restructuring existing platforms to improve clarity, consistency, and long-term durability. Detailed case studies and materials are available upon request.",
    "tags": ["UX/UI"],
    "selected": true,
    "externalLink": "",
    "sub": "",
    "image": "src/00_25_02.png",
    "hoverImage": "src/00_25_01.png",
    "category": "",
    "gallery": ["src/00_25_02.png", "src/00_25_03.png", "src/00_25_04.png"]
  },
  {
    "slug": "design-economy",
    "title": "Design Economy",
    "year": "2025",
    "description": "Design Economy is an editorial project developed for Fondazione Symbola, centered on the visual interpretation of economic and cultural data related to the Italian design sector. The goal was to translate structured datasets into a coherent visual system suitable for publication.\n\nI was responsible for the graphic layout, overall visual language, and the design of the data visualizations. The work combined data visualization and editorial design to support readability and narrative flow, aligning analytical content with a structured and accessible visual framework.",
    "tags": ["Data Viz", "Editorial Design"],
    "selected": true,
    "externalLink": "https://symbola.net/ricerca/design-economy-2025/",
    "sub": "",
    "image": "src/01_25_02.png",
    "hoverImage": "src/01_25_01.png",
    "category": "",
    "gallery": ["src/01_25_02.png", "src/01_25_03.png", "src/01_25_04.png"]
  },
  {
    "slug": "milano-oltre-il-visibile",
    "title": "Milano oltre il visibile",
    "year": "2025",
    "description": "Milano oltre il visibile is a data-driven project exploring the city of Milan through cartographic and spatial visualizations that move beyond its visible and institutional narratives. The project focuses on representing urban phenomena through data and geography.\n\nDeveloped as part of Propp, my contribution involved translating structured information into maps and visual systems that support interpretation and exploration. The work balances analytical accuracy with editorial clarity, integrating visualizations into a broader narrative framework without enforcing a singular reading of the data.",
    "tags": ["Data Viz", "Editorial"],
    "selected": false,
    "externalLink": "https://propp.it/Milano-oltre-il-visibile",
    "sub": "",
    "image": "src/02_25_02.png",
    "hoverImage": "src/02_25_01.png",
    "category": "",
    "gallery": ["src/02_25_02.png", "src/02_25_03.png"]
  },
  {
    "slug": "antarctic-resolution",
    "title": "Antarctic Resolution",
    "year": "2020",
    "description": "Antarctic Resolution is an editorial research project investigating Antarctica as a complex geopolitical and environmental system. The publication relies on data visualization to support analysis and interpretation across multiple layers of information.\n\nWithin a data visualization team at The Pomo, I contributed to the visual translation of datasets prepared by the research team. Using RAWGraphs for exploration and Adobe Illustrator for refinement, the work focused on clarity, consistency, and accuracy, aligning with strict editorial constraints and integrating seamlessly into a publication designed by others.",
    "tags": ["Data Viz", "Editorial"],
    "selected": true,
    "externalLink": "",
    "sub": "",
    "image": "src/8.png",
    "hoverImage": "src/8H.png",
    "category": "INFORMATION DESIGN",
    "gallery": ["src/08_01.png", "src/08_02.png"]
  },
  {
    "slug": "cfs-lab",
    "title": "CFS Lab",
    "year": "2025",
    "description": "CFS Lab is the research laboratory of the Politecnico di Milano, for which a digital platform was designed as the foundation of its online presence. The current implementation takes the form of a landing page, conceived as the first step of a broader system.\n\nI designed the structure and UX of the platform and developed the website using WordPress, starting from a complete system defined and prototyped in Figma. The project was approached as a scalable framework, intended to support future growth in content, research outputs, and institutional communication.",
    "tags": ["UX/UI", "Product"],
    "selected": false,
    "externalLink": "https://www.circularfoodsystemlab.polimi.it/",
    "sub": "",
    "image": "src/04_25_02.png",
    "hoverImage": "src/04_25_01.png",
    "category": "",
    "gallery": ["src/04_25_02.png", "src/04_25_03.png", "src/04_25_04.png"]
  },
  {
    "slug": "discojournal",
    "title": "DiscoJournal",
    "year": "2022–2025",
    "description": "DiscoJournal is a digital platform created for a collective of researchers, designed to support evolving editorial formats over time. Each annual issue adopts a distinct form and visual language in response to its theme, while remaining anchored to a shared framework.\n\nMy work focused on defining this flexible visual and structural system during the initial branding and digital identity phase. The result is an adaptable platform that allows the website to evolve across editions while preserving coherence, recognizability, and usability for content-heavy research outputs.",
    "tags": ["UX/UI", "Product"],
    "selected": false,
    "externalLink": "https://discojournal.com/",
    "sub": "",
    "image": "src/4.png",
    "hoverImage": "src/4H.png",
    "category": "",
    "gallery": ["src/05_25_02.png","src/05_25_03.png","src/04_01.png", "src/04_02.png", "src/04_03.png", "src/04_04.png", "src/04_05.png"]
  },
  {
    "slug": "superforma",
    "title": "Superforma",
    "year": "2020–2025",
    "description": "Superforma is a hybrid platform combining digital tools, physical activities, and community-driven initiatives. Over a five-year period, the project evolved into a structured ecosystem rather than a collection of isolated outputs.\n\nMy role included the design and development of the website, the definition of the visual identity and social communication, and the organization of workshops and public events. As a partner in the project, I contributed to shaping Superforma as a durable and recognizable system, integrating digital presence, fabrication practices, and educational activities.",
    "tags": ["Product", "Digital"],
    "selected": false,
    "externalLink": "",
    "sub": "",
    "image": "src/1.png",
    "hoverImage": "src/1H.png",
    "category": "",
    "gallery": ["src/01_01.png", "src/01_02.png", "src/01_03.png", "src/01_04.png"]
  },
  {
    "slug": "doublecheck",
    "title": "DoubleCheck",
    "year": "2019",
    "description": "DoubleCheck is an interactive web project designed to test users’ ability to recognize manipulated and misleading images online. The experience is structured as a quiz and was developed as the final project of Density Design.\n\nThe work focused on structuring the interaction flow and ensuring clarity and usability across different contexts. The platform was translated into 22 languages, requiring particular attention to scalability, accessibility, and consistency across localized versions.",
    "tags": ["UX/UI", "Product"],
    "selected": false,
    "externalLink": "https://doublecheck.theglassroom.org/english/about.html",
    "sub": "",
    "image": "src/5.png",
    "hoverImage": "src/5H.png",
    "category": "",
    "gallery": ["src/05_01.png", "src/05_02.png", "src/05_03.png"]
  },
  {
    "slug": "data-visualization-studies",
    "title": "Data Visualization Studies",
    "year": "2019–2025",
    "description": "Data Visualization Studies groups a series of projects exploring how data can be translated into maps and visual systems to support interpretation and exploration. The work includes cartographic and infographic contributions developed for The Passenger as part of Propp, as well as experimental visualizations focused on algorithmic mediation and data relationships.\n\nAcross these projects, my contribution centered on transforming structured datasets into readable visual forms. The visualizations balance accuracy, clarity, and narrative coherence, and are designed to invite exploration rather than impose a single interpretation.",
    "tags": ["Data Viz", "Editorial"],
    "selected": false,
    "externalLink": "",
    "sub": "",
    "image": "src/4.png",
    "hoverImage": "src/4H.png",
    "category": "",
    "gallery": ["src/04_01.png", "src/04_02.png", "src/04_03.png", "src/04_04.png", "src/04_05.png", "src/05_01.png", "src/05_02.png", "src/05_03.png"]
  }
]
