[
  {
    "slug": "enterprise-ux-systems",
    "title": "Enterprise UX Systems",
    "description": "I am working, as part of Propp, on the design and redesign of internal digital systems for enterprise contexts. The work spans multiple projects focused on operational workflows, request handling, and content-heavy platforms, developed under confidentiality constraints and within existing technical and organizational frameworks.\n\nMy contribution focuses on UX and UI design, including information architecture, user flows, state-based diagrams, and the development of shared design systems. The projects involve extending and restructuring existing platforms while ensuring clarity, consistency, and long-term durability. Detailed case studies and materials are available upon request.",
    "tags": ["UX/UI", "Enterprise", "IA", "Sanitized"],
    "selected": true,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/1.png",
    "hoverImage": "src/1H.png",
    "category": "",
    "gallery": ["src/01_01.png", "src/01_02.png", "src/01_03.png", "src/01_04.png"]
  },
  {
    "slug": "antarctic-resolution",
    "title": "Antarctic Resolution",
    "description": "I worked as part of a data visualization team within The Pomo on Antarctic Resolution, an editorial research project investigating Antarctica as a complex geopolitical and environmental system. Starting from datasets cleaned and structured by the research team, I contributed to the visual translation of information intended to support the publication’s analytical narrative.\n\nUsing RAWGraphs for exploration and Adobe Illustrator for refinement, I developed a series of visualizations focused on clarity, consistency, and accuracy. My work aimed to represent relationships and patterns without introducing interpretative bias, aligning with strict editorial constraints and integrating seamlessly into a publication designed by others.",
    "tags": ["Data Viz", "Editorial"],
    "selected": true,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/8.png",
    "hoverImage": "src/8H.png",
    "category": "INFORMATION DESIGN",
    "gallery": ["src/08_01.png", "src/08_02.png"]
  },
  {
    "slug": "design-economy",
    "title": "Design Economy",
    "description": "I worked on Design Economy, an editorial data visualization project developed for Fondazione Symbola, focusing on the visual interpretation of economic and cultural data related to the Italian design sector. The project required translating structured datasets into a coherent visual system suitable for an editorial publication.\n\nI was responsible for the graphic layout, overall visual language, and the design of the data visualizations, ensuring consistency across the publication. The work combined data visualization and editorial design to support clarity, readability, and narrative flow, aligning analytical content with a structured and accessible visual framework.",
    "tags": ["Data Viz", "Editorial Design"],
    "selected": true,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/9.png",
    "hoverImage": "src/9H.png",
    "category": "",
    "gallery": ["src/09_01.png", "src/09_02.png"]
  },
  {
    "slug": "data-visualization-studies",
    "title": "Data Visualization Studies",
    "description": "I worked on a series of data visualization projects exploring how data can be translated into maps and visual systems to support interpretation and exploration. The work includes cartographic and infographic contributions developed as part of Propp for The Passenger, as well as experimental visualizations focused on algorithmic mediation and data relationships.\n\nAcross these projects, my contribution focused on transforming structured datasets into readable visual forms, balancing accuracy, clarity, and narrative coherence. The visualizations were designed to invite exploration rather than impose a single interpretation, supporting editorial and analytical contexts through restrained and systematic visual choices.",
    "tags": ["Data Viz", "Cartography", "Editorial"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/4.png",
    "hoverImage": "src/4H.png",
    "category": "",
    "gallery": ["src/04_01.png", "src/04_02.png", "src/04_03.png", "src/04_04.png", "src/04_05.png", "src/05_01.png", "src/05_02.png", "src/05_03.png"]
  },
  {
    "slug": "milano-oltre-il-visibile",
    "title": "Milano oltre il visibile",
    "description": "I worked on Milano oltre il visibile as part of Propp, contributing to the design of cartographic and data visualizations exploring the city of Milan beyond its visible and institutional narratives. The project focused on representing urban phenomena through data-driven and spatial perspectives.\n\nMy contribution involved translating structured information into maps and visual systems that could support interpretation and exploration. The work balanced analytical accuracy with editorial clarity, integrating visualizations into a broader narrative framework without imposing a singular reading of the data.",
    "tags": ["Data Viz", "Cartography", "Editorial"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "https://propp.it/Milano-oltre-il-visibile",
    "sub": "",
    "image": "src/12_01.png",
    "hoverImage": "src/12_02.png",
    "category": "",
    "gallery": ["src/12_01.png", "src/12_02.png", "src/12_03.png", "src/12_04.png"]
  },
  {
    "slug": "discojournal",
    "title": "DiscoJournal",
    "description": "I worked on DiscoJournal as part of the initial branding and digital identity design for a collective of researchers. The project involved defining a flexible visual and structural system capable of supporting different editorial directions over time.\n\nEach annual issue adopts a distinct form and visual language in response to its theme, while remaining anchored to a shared framework. My work focused on establishing this adaptable system, allowing the website to evolve across editions while preserving coherence, recognizability, and usability for content-heavy research outputs.",
    "tags": ["UX/UI", "Editorial Systems"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/6.png",
    "hoverImage": "src/6H.png",
    "category": "",
    "gallery": ["src/06_01.png", "src/06_02.png"]
  },
  {
    "slug": "cfs-lab",
    "title": "CFS Lab",
    "description": "I worked on the design and development of a website for CFS Lab, a research laboratory at the Politecnico di Milano. The project currently takes the form of a landing page, conceived as the first step of a broader digital platform, with the full system designed and prototyped in Figma.\n\nMy work focused on defining the structure and UX of the platform and translating it into a functional website built with WordPress. The project was approached as a scalable system, designed to support future growth in content, research outputs, and institutional communication while maintaining clarity and consistency.",
    "tags": ["UX/UI", "Systems"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/2.png",
    "hoverImage": "src/2H.png",
    "category": "",
    "gallery": ["src/02_01.png", "src/02_02.png", "src/02_04.png"]
  },
  {
    "slug": "doublecheck",
    "title": "DoubleCheck",
    "description": "DoubleCheck is an interactive web project designed to test users’ ability to recognize manipulated and misleading images online. The project takes the form of a quiz-based experience and was developed as part of the final project of Density Design.\n\nI worked on the design and implementation of the website, focusing on structuring the interaction flow and ensuring clarity and usability across a wide range of contexts. The platform was translated into 22 languages, requiring particular attention to scalability, accessibility, and consistency across localized versions.",
    "tags": ["UX/UI", "Service", "Platform"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "https://doublecheck.theglassroom.org/english/about.html",
    "sub": "",
    "image": "src/3.png",
    "hoverImage": "src/3H.png",
    "category": "",
    "gallery": ["src/03_01.png", "src/03_02.png", "src/03_03.png", "src/03_04.png"]
  },
  {
    "slug": "superforma",
    "title": "Superforma",
    "description": "I worked on Superforma over a five-year period, contributing to the design and evolution of its digital presence and communication ecosystem. My role included the design and development of the website, as well as the definition of the brand’s visual identity and social communication.\n\nBeyond the digital platform, I was involved in organizing workshops and public events, contributing to the growth of Superforma as a structured and recognizable system rather than a single project. The work reflects a long-term approach to building and maintaining a platform that integrates digital tools, physical activities, and community engagement.",
    "tags": ["Systems", "Platform", "Digital Fabrication"],
    "selected": false,
    "year": "",
    "collaborators": "",
    "externalLink": "",
    "sub": "",
    "image": "src/7.png",
    "hoverImage": "src/7H.png",
    "category": "",
    "gallery": ["src/07_01.png", "src/07_02.png", "src/07_03.png", "src/07_04.png"]
  }
]
